window.onload=function () {
  var data={
    "welcome":["欢迎开启尚游专栏之旅","成为专栏达人"],
    "recommend":[
      ["img/1.jpg","一个不浪会死的旅人","既然来到这个星球，那就步履不停，好好看看~"],
      ["img/1.1.jpg","行走的丧失","从米其林到街边摊，带你尝遍我旅途中所遇的美味"],
      ["img/1.2.jpg","Samuel廣玩港食的专栏","深入了解世界每一座城市的人文与自然，聆听一个个动人的怀旧故事"],
      ["img/1.3.jpg","探访意大利世遗","旅意8年，走过39个世遗，长路漫漫，犹在途中，我把意大利世遗的故事说给你听。\t"],
      ["img/1.4.jpg","少侠米粒漫游记","记录我走过的地方，通过我的视角，发现城市的文化／气质，感受城市之美。\t"],
      ["img/1.5.jpg","Lulu的99个旅行故事","不喜欢戴耳机的旅行，因为想听见来自当地最真实的声音。30多个国家，100多个城镇"]
    ],
    "recommend2":[
      ["img/4.jpg","在丹吉尔被骗一次，摩洛哥就通关了一半","刚得知摩洛哥免签的消息后，没多想就立刻买下了一张从Algercias到Tangier的船票。陌生到连拼写都记不住的地名，...","一天前","来自专栏流浪月子"],
      ["img/4.1.jpg","阿尔勒的梵高咖啡馆，路过就好","  法国 咖啡馆的风情很特别，你说它环境好吧，它不如 维也纳 的繁花似锦，富丽堂皇。它们往往被刷上了朱红或墨绿的外墙，安...","一天前","来自专栏味蕾述说的故事"],
      ["img/4.2.jpg","阿尔卑斯式徒步","突然置身于悬崖边难免会感到害怕，甚至腿脚发软，但如果是自己一步步爬上来的，回头看到的却是风景本身。","二天前","来自专栏流浪月子"],
      ["img/4.3.jpg","一份「离开地球表面」的最全旅游指南！","//不知道大家会不会和我一样，时不时的都会有想要从地球消失一段时间的想法。对于我来说，每到冬日的年末假期，我的这种想法就...","三天前","来自专栏阿蕾Lena的专栏"],
      ["img/4.4.jpg","在丹吉尔被骗一次，摩洛哥就通关了一半","“在未来到来之前，让我们珍惜这幸福的瞬间，我们的每一天。”「未来が来るその前に幸せなこの瞬间を大切に积み重ねていこう私た...","四天前","来自专栏熊和考拉走天涯"],
      ["img/4.5.jpg","在丹吉尔被骗一次，摩洛哥就通关了一半","刚得知摩洛哥免签的消息后，没多想就立刻买下了一张从Algercias到Tangier的船票。陌生到连拼写都记不住的地名，...","一天前","来自专栏流浪月子"],
      ["img/4.6.jpg","阿尔勒的梵高咖啡馆，路过就好","  法国 咖啡馆的风情很特别，你说它环境好吧，它不如 维也纳 的繁花似锦，富丽堂皇。它们往往被刷上了朱红或墨绿的外墙，安...","一天前","来自专栏味蕾述说的故事"],
      ["img/4.7.jpg","阿尔卑斯式徒步","突然置身于悬崖边难免会感到害怕，甚至腿脚发软，但如果是自己一步步爬上来的，回头看到的却是风景本身。","二天前","来自专栏流浪月子"],
      ["img/4.8.jpg","一份「离开地球表面」的最全旅游指南！","//不知道大家会不会和我一样，时不时的都会有想要从地球消失一段时间的想法。对于我来说，每到冬日的年末假期，我的这种想法就...","三天前","来自专栏阿蕾Lena的专栏"],
    ]
  }

  for (var i = 0; i < data.welcome.length; i++) {
    var ps=document.createElement("p");
    ps.innerText= data.welcome[i]
    document.querySelector(".welcome").appendChild(ps)
  }

  for (var i = 0; i < data.recommend.length; i++) {
    document.querySelector(".recommend").innerHTML+=
      "<div class=\"section\"><img src=\""+data.recommend[i][0]+
      "\" alt=\"\"><p>"+data.recommend[i][1]+"</p><p>"
    +data.recommend[i][2]+"</p></div>"
  }

  for (var i = 0; i < data.recommend2.length; i++) {
    document.querySelector(".recommend2").innerHTML+=
      "<div class=\"section2\"><img class=\"se-l\" src=\""
    +data.recommend2[i][0]+"\" alt=\"\"><div class=\"se-r\"><h2>"
    +data.recommend2[i][1]+"</h2><p>"
    +data.recommend2[i][2]+"</p><p><span>"
    +data.recommend2[i][3]+"</span><span>"
    +data.recommend2[i][4]+"</span></p></div></div>"
  }







}