window.onload=function () {
  var data = {
    details: [
      "签证类型：美国个人旅游/商务/探亲/更新签证",
      "入境次数：多次",
      "停留时间：180天",
      "有效时间：10年",
      "办理时长：9个工作日",
      "是否面试：是",
      "递签城市： 北京、上海、成都、广州、沈阳（以上领区均需本人递签）",
      "受理范围：北京,重庆,湖北,陕西,江苏,安徽,甘肃,河北,河南,湖南,江西,",
      "内蒙古,宁夏,青海,山东,山西,新疆,西藏,浙江,上海,江苏,安徽,浙江，",
      "广东,福建,海南,广西",
      "是否需要交押金：否",
      "签证类型：美国F1留学签证",
      "入境次数：多次",
      "停留时间：以申请行程为准",
      "有效时间：以使馆签发为准",
      "办理时长：9个工作日（收齐材料之后）",
      "是否面试：是",
      "递签城市： 北京、",
      "受理范围：北京,天津,湖北,陕西,甘肃,河北,河南,湖南,江西,内蒙古",
      "宁夏,青海,山东,山西,新疆,西藏"
    ]
  }
  //传签证详情数据
  var details = document.querySelector(".details")//获取签证详情盒子
  for (var i = 0; i < data.details.length; i++) {
    details.innerHTML+="<p>"+data.details[i]+"</p>"
  }


}