window.onload = function () {
  var data = {
    "con-l": [
      ["img/2.jpg", "莫小贝", "img/3.jpg", "房间", "对台湾的认识，感觉还挺复杂的，分阶段来说吧。在最初的时候，我眼中的台湾就是那些游记照片中的样子，有美到不真实的鹅卵石和清水断崖，有吃不完的夜市和让人馋嘴小吃。是九把刀笔下《那些年》的样子，有幼稚的男孩和说起话来嗲嗲的女孩，有...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.1.jpg", "莫优璇", "img/4.8.jpg", "丽江旅游", "为了静，去丽江？这是什么梗？丽江的安静时间，凌晨2：00-8：00之间，你想什么玩？丽江近几年出了那么多新闻，真是毫无听闻？如果你的愿望是真的，到丽江周边找地方玩，还是有不错的地方。比如：永胜的程海。坐不坐火车，看自己的时间和预算...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.2.jpg", "何雨嘉", "img/4.7.jpg", "旅行证", "来决定。玩丽江附近的徒步线路很多，比如虎跳峡山上的徒步线路，在中虎跳找间客栈住一晚，吃吃鸡。然后可以从中虎跳徒步到大具，再经过玉龙雪山，回到丽江。想静一静，可以关注一下这条线，过了下虎跳峡，稍远处有一个叫“白水台”的风景区,有吃不完的夜市和让人馋嘴小吃。...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.3.jpg", "莫明美", "img/4.6.jpg", "意大利", "钙化池景观，基本上没有什么游客。建议可以去看看。以上景区、线路资料，上网搜吧，建议只供参考。提醒注意，徒步有风险，飞石在峡谷线路中是很常见的，有个伴，能相互照应下，也是很有必要的。是九把刀笔下吃去新城找居民区、菜市场，吃腊味火锅...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.4.jpg", "唐惠茜", "img/4.5.jpg", "欧洲旅行", "，本地食客多的店，品质有一定水准。老城里，适合泡吧。泸沽湖风景好，且安静的选择，推荐到四川省界内一侧游玩住宿。不知道你玩多少天，不猜了。以上供你参考吧。不知道你玩多少天，不猜了。以上供你参考吧。《那些年》的样子菜市场，吃腊味火锅...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.5.jpg", "周嫦曦", "img/4.4.jpg", "签证问题", "钙化池景观，基本上没有什么游客。建议可以去看看。以上景区、线路资料，上网搜吧，建议只供参考。提醒注意，徒步有风险，飞石在峡谷线路中是很常见的，有个伴，能相互照应下，也是很有必要的。是九把刀笔下吃去新城找居民区、菜市场，吃腊味火锅...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.6.jpg", "廖雨婷", "img/4.2.jpg", "游客", "，本地食客多的店，品质有一定水准。老城里，适合泡吧。泸沽湖风景好，且安静的选择，推荐到四川省界内一侧游玩住宿。不知道你玩多少天，不猜了。以上供你参考吧。不知道你玩多少天，不猜了。以上供你参考吧。《那些年》的样子菜市场，吃腊味火锅...", "台湾", "发布于2016-06-07 14:10"],
      ["img/2.7.jpg", "胡珺瑶", "img/4.1.jpg", "哪里买", "对台湾的认识，感觉还挺复杂的，分阶段来说吧。在最初的时候，我眼中的台湾就是那些游记照片中的样子，有美到不真实的鹅卵石和清水断崖，有吃不完的夜市和让人馋嘴小吃。是九把刀笔下《那些年》的样子，有幼稚的男孩和说起话来嗲嗲的女孩，有...", "台湾", "发布于2016-06-07 14:10"]
    ],
    "con-r":[
      ["img/4.jpg","吴雅琳","26.2w"],
      ["img/4.1.jpg","何芸熙","21.1w"],
      ["img/4.2.jpg","唐天瑜","15.8w"],
      ["img/4.3.jpg","张梦瑶","12.4w"],
      ["img/4.4.jpg","胡雪雁","5.2w"],
      ["img/4.5.jpg","廖雨嘉","2.3w"],
      ["img/4.6.jpg","欧阳雨婷","1.6w"],
      ["img/4.7.jpg","冯馨彤","1.6w"],
      ["img/4.8.jpg","朱羽馨","0.6w"],
      ["img/4.9.jpg","李靖瑶","0.5w"]
    ]
  }

  for (var i = 0; i < data["con-l"].length; i++) {
    document.querySelector(".con-l").innerHTML +=
      "<div class=\"section clearfix\"><div class=\"icon\"><img alt=\"\" src=\""
      + data["con-l"][i][0] + "\"><span>"
      + data["con-l"][i][1] + "</span></div><div class=\"se-cen\"><div class=\"se-l\"><img alt=\"\" src=\""
      + data["con-l"][i][2] + "\"><span>"
      + data["con-l"][i][3] + "</span></div><div class=\"se-r\"><p>"
      + data["con-l"][i][4] + "</p><div><span>"
      + data["con-l"][i][5] + "</span><span>"
      + data["con-l"][i][6] + "</span></div></div></div></div>"
  }

  for (var i = 0; i < data["con-r"].length; i++) {
    document.querySelector(".con-r").innerHTML+=
      "<div class=\"con-sec\"><span>"+(i+1)+"</span><img alt=\"\" src=\""
    +data["con-r"][i][0]+"\"><span>"
    +data["con-r"][i][1]+"</span><i>"
    +data["con-r"][i][2]+"</i></div>"
  }

}